mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
/**
 * @file uart.c
 * @brief UART驱动模块实现
 * @version 1.0.0
 * @date 2024-01-01
 * @details 基于STM32标准外设库的UART驱动，支持UART1/2/3，阻塞式发送/接收，可配置波特率、数据位、停止位、校验位
 */

/* Include config.h first to get module enable flags */
#include "config.h"

#if CONFIG_MODULE_UART_ENABLED

/* Include our header */
#include "uart.h"

#include "gpio.h"
#include "delay.h"
#include "nvic.h"
#include "dma.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_usart.h"
#include "misc.h"
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

/* 从board.h加载配置 */
static UART_Config_t g_uart_configs[UART_INSTANCE_MAX] = UART_CONFIGS;

/* 初始化标志 */
static bool g_uart_initialized[UART_INSTANCE_MAX] = {false, false, false};

/* 硬件流控配置 */
static UART_HW_FlowControl_t g_uart_hw_flow[UART_INSTANCE_MAX] = {UART_HW_FLOW_NONE, UART_HW_FLOW_NONE, UART_HW_FLOW_NONE};

/* 默认超时时间（毫秒） */
#define UART_DEFAULT_TIMEOUT_MS  1000

/* 中断回调函数数组 */
static UART_IT_Callback_t g_uart_it_callbacks[UART_INSTANCE_MAX][8] = {NULL};
static void *g_uart_it_user_data[UART_INSTANCE_MAX][8] = {NULL};

/* 中断模式发送/接收缓冲区 */
static const uint8_t *g_uart_tx_buffer[UART_INSTANCE_MAX] = {NULL};
static uint8_t *g_uart_rx_buffer[UART_INSTANCE_MAX] = {NULL};
static uint16_t g_uart_tx_length[UART_INSTANCE_MAX] = {0};
static uint16_t g_uart_tx_index[UART_INSTANCE_MAX] = {0};
static uint16_t g_uart_rx_length[UART_INSTANCE_MAX] = {0};
static uint16_t g_uart_rx_index[UART_INSTANCE_MAX] = {0};
static uint16_t g_uart_rx_max_length[UART_INSTANCE_MAX] = {0};

/* DMA通道映射（UART TX/RX对应的DMA通道） */
static const DMA_Channel_t uart_tx_dma_channels[UART_INSTANCE_MAX] = {
    DMA_CHANNEL_1_1,  /* UART1 TX -> DMA1_CH1 */
    DMA_CHANNEL_1_3,  /* UART2 TX -> DMA1_CH3 */
    DMA_CHANNEL_1_5,  /* UART3 TX -> DMA1_CH5 */
};

static const DMA_Channel_t uart_rx_dma_channels[UART_INSTANCE_MAX] = {
    DMA_CHANNEL_1_2,  /* UART1 RX -> DMA1_CH2 */
    DMA_CHANNEL_1_4,  /* UART2 RX -> DMA1_CH4 */
    DMA_CHANNEL_1_6,  /* UART3 RX -> DMA1_CH6 */
};

/**
 * @brief 获取UART外设时钟
 * @param[in] uart_periph UART外设指针
 * @return uint32_t 时钟使能值，失败返回0
 */
static uint32_t UART_GetPeriphClock(USART_TypeDef *uart_periph)
{
    (void)uart_periph;
    return 0;
}

/**
 * @brief 获取UART GPIO时钟
 * @param[in] port GPIO端口指针
 * @return uint32_t GPIO时钟使能值
 */
static uint32_t UART_GetGPIOClock(GPIO_TypeDef *port)
{
    (void)port;
    return 0;
}

/**
 * @brief 等待UART标志位
 * @param[in] uart_periph UART外设指针
 * @param[in] flag 标志位
 * @param[in] timeout_ms 超时时间（毫秒）
 * @return UART_Status_t 错误码
 */
static UART_Status_t UART_WaitFlag(USART_TypeDef *uart_periph, uint16_t flag, uint32_t timeout_ms)
{
    (void)uart_periph;
    (void)flag;
    (void)timeout_ms;
    /* 编译时警告 */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART初始化
 */
UART_Status_t UART_Init(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART反初始化
 */
UART_Status_t UART_Deinit(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART发送数据（阻塞式）
 */
UART_Status_t UART_Transmit(UART_Instance_t instance, const uint8_t *data, uint16_t length, uint32_t timeout)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    (void)timeout;
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART接收数据（阻塞式）
 */
UART_Status_t UART_Receive(UART_Instance_t instance, uint8_t *data, uint16_t length, uint32_t timeout)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    (void)timeout;
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART发送单个字节（阻塞式）
 */
UART_Status_t UART_TransmitByte(UART_Instance_t instance, uint8_t byte, uint32_t timeout)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    (void)byte;
    (void)timeout;
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART接收单个字节（阻塞式）
 */
UART_Status_t UART_ReceiveByte(UART_Instance_t instance, uint8_t *byte, uint32_t timeout)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (byte == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    
    /* ========== 占位空函数 ========== */
    (void)timeout;
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART发送字符串（阻塞式）
 */
UART_Status_t UART_TransmitString(UART_Instance_t instance, const char *str, uint32_t timeout)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (str == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    
    /* ========== 占位空函数 ========== */
    (void)timeout;
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 检查UART是否已初始化
 */
uint8_t UART_IsInitialized(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0（未初始化） */
    }
    
    /* ========== 占位空函数 ========== */
    return 0;
}

/**
 * @brief 获取UART外设指针
 */
USART_TypeDef* UART_GetPeriph(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return NULL;  /* 无效实例返回NULL */
    }
    
    /* ========== 占位空函数 ========== */
    return NULL;
}

/* ========== 中断模式功能实现 ========== */

/**
 * @brief 获取UART中断类型对应的SPL库中断值
 */
static uint16_t UART_GetITValue(UART_IT_t it_type)
{
    (void)it_type;
    return 0;
}

/**
 * @brief 获取UART中断向量
 */
static IRQn_Type UART_GetIRQn(UART_Instance_t instance)
{
    (void)instance;
    return (IRQn_Type)0;
}

/**
 * @brief 使能UART中断
 */
UART_Status_t UART_EnableIT(UART_Instance_t instance, UART_IT_t it_type)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (it_type > UART_IT_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 禁用UART中断
 */
UART_Status_t UART_DisableIT(UART_Instance_t instance, UART_IT_t it_type)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (it_type > UART_IT_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 设置UART中断回调函数
 */
UART_Status_t UART_SetITCallback(UART_Instance_t instance, UART_IT_t it_type,
                                  UART_IT_Callback_t callback, void *user_data)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (it_type > UART_IT_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    /* 注意：callback可以为NULL（表示禁用回调），user_data可以为NULL */
    
    /* ========== 占位空函数 ========== */
    (void)callback;
    (void)user_data;
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 获取UART中断状态
 */
uint8_t UART_GetITStatus(UART_Instance_t instance, UART_IT_t it_type)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    if (it_type > UART_IT_CTS) {
        return 0;  /* 无效中断类型返回0 */
    }
    
    /* ========== 占位空函数 ========== */
    return 0;
}

/**
 * @brief 清除UART中断挂起标志
 */
UART_Status_t UART_ClearITPendingBit(UART_Instance_t instance, UART_IT_t it_type)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (it_type > UART_IT_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART非阻塞发送（中断模式）
 */
UART_Status_t UART_TransmitIT(UART_Instance_t instance, const uint8_t *data, uint16_t length)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART非阻塞接收（中断模式）
 */
UART_Status_t UART_ReceiveIT(UART_Instance_t instance, uint8_t *data, uint16_t max_length)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (max_length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 获取UART发送剩余字节数（中断模式）
 */
uint16_t UART_GetTransmitRemaining(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
    /* ========== 占位空函数 ========== */
    return 0;
}

/**
 * @brief 获取UART接收到的字节数（中断模式）
 */
uint16_t UART_GetReceiveCount(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
    /* ========== 占位空函数 ========== */
    return 0;
}

/**
 * @brief UART中断服务函数
 */
void UART_IRQHandler(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return;  /* 无效实例直接返回 */
    }
    
    /* ========== 占位空函数 ========== */
    /* 功能未实现 */
}

/* UART中断服务程序入口（需要在启动文件中定义，或用户自己实现） */
void USART1_IRQHandler(void)
{
}


void USART2_IRQHandler(void)
{
}


void USART3_IRQHandler(void)
{
}


/* ========== DMA模式功能实现 ========== */

/**
 * @brief UART DMA发送
 */
UART_Status_t UART_TransmitDMA(UART_Instance_t instance, const uint8_t *data, uint16_t length)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief UART DMA接收
 */
UART_Status_t UART_ReceiveDMA(UART_Instance_t instance, uint8_t *data, uint16_t length)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 停止UART DMA发送
 */
UART_Status_t UART_StopTransmitDMA(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 停止UART DMA接收
 */
UART_Status_t UART_StopReceiveDMA(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 获取UART DMA发送剩余字节数
 */
uint16_t UART_GetTransmitDMARemaining(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
    /* ========== 占位空函数 ========== */
    return 0;
}

/**
 * @brief 获取UART DMA接收剩余字节数
 */
uint16_t UART_GetReceiveDMARemaining(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
    /* ========== 占位空函数 ========== */
    return 0;
}

/* ========== 硬件流控功能实现 ========== */

/**
 * @brief 配置UART硬件流控
 */
UART_Status_t UART_SetHardwareFlowControl(UART_Instance_t instance, UART_HW_FlowControl_t flow_control)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (flow_control > UART_HW_FLOW_RTS_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 获取UART硬件流控配置
 */
UART_Status_t UART_GetHardwareFlowControl(UART_Instance_t instance, UART_HW_FlowControl_t *flow_control)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (flow_control == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/* ========== 单线半双工模式功能实现 ========== */

/**
 * @brief 使能UART单线半双工模式
 */
UART_Status_t UART_EnableHalfDuplex(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 禁用UART单线半双工模式
 */
UART_Status_t UART_DisableHalfDuplex(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 检查UART是否处于单线半双工模式
 */
uint8_t UART_IsHalfDuplex(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
    /* ========== 占位空函数 ========== */
    return 0;
}

/* ========== LIN/IrDA/智能卡模式功能实现 ========== */

/**
 * @brief 使能UART LIN模式
 */
UART_Status_t UART_EnableLINMode(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 禁用UART LIN模式
 */
UART_Status_t UART_DisableLINMode(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 发送LIN断点字符
 */
UART_Status_t UART_SendBreak(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 使能UART IrDA模式
 */
UART_Status_t UART_EnableIrDAMode(UART_Instance_t instance, uint8_t prescaler)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (prescaler == 0 || prescaler > 31) {
        return UART_ERROR_INVALID_PARAM;  /* IrDA预分频器范围：1-31 */
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 禁用UART IrDA模式
 */
UART_Status_t UART_DisableIrDAMode(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 使能UART智能卡模式
 */
UART_Status_t UART_EnableSmartCardMode(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 禁用UART智能卡模式
 */
UART_Status_t UART_DisableSmartCardMode(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    /* ========== 占位空函数 ========== */
    #warning "UART函数: 占位空函数，功能未实现，待完善"
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

#endif /* CONFIG_MODULE_UART_ENABLED */

